In [2]:
import numpy as np
import pandas as pd

In [6]:
dict1={
    "name":["rajiv","rohan","melina","lokesh"],
    "skill":["webdevelopr","nth","housewife","US"],
    "marks":[10,12,14,16]
}

In [7]:
df=pd.DataFrame(dict1)
df

     name        skill  marks
0   rajiv  webdevelopr     10
1   rohan          nth     12
2  melina    housewife     14
3  lokesh           US     16

In [ ]:
df.to_csv('friends.csv',index=False)

In [ ]:
df.head(2)

In [10]:
df.tail(3)

     name      skill  marks
1   rohan        nth     12
2  melina  housewife     14
3  lokesh         US     16

df.describe describes the statistical analysis of numerical values

In [12]:
df.describe()

           marks
count   4.000000
mean   13.000000
std     2.581989
min    10.000000
25%    11.500000
50%    13.000000
75%    14.500000
max    16.000000

In [13]:
df['marks']

0    10
1    12
2    14
3    16
Name: marks, dtype: int64

In [17]:
df['marks'][0]=50

<ipython-input-17-1fb84e789d71>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['marks'][0]=50

In [21]:
df['skill'][0]="datascientist"

<ipython-input-21-d320e7a6a735>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['skill'][0]="datascientist"

In [22]:
df

     name          skill  marks
0   rajiv  datascientist     50
1   rohan            nth     12
2  melina      housewife     14
3  lokesh             US     16

In [24]:
df['name'][1]="mohan"

<ipython-input-24-bbfa4ae0543d>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][1]="mohan"

In [25]:
df

     name          skill  marks
0   rajiv  datascientist     50
1   mohan            nth     12
2  melina      housewife     14
3  lokesh             US     16

In [26]:
df.T

                   0      1          2       3
name           rajiv  mohan     melina  lokesh
skill  datascientist    nth  housewife      US
marks             50     12         14      16

In [27]:
df

     name          skill  marks
0   rajiv  datascientist     50
1   mohan            nth     12
2  melina      housewife     14
3  lokesh             US     16

In [29]:
df.sort_index(axis=0,ascending=False)

     name          skill  marks
3  lokesh             US     16
2  melina      housewife     14
1   mohan            nth     12
0   rajiv  datascientist     50

In [9]:
newdf=df.copy()

In [10]:
newdf

     name        skill  marks
0   rajiv  webdevelopr     10
1   rohan          nth     12
2  melina    housewife     14
3  lokesh           US     16

In [11]:
newdf.drop('name',axis=1)

         skill  marks
0  webdevelopr     10
1          nth     12
2    housewife     14
3           US     16

In [12]:
df

     name        skill  marks
0   rajiv  webdevelopr     10
1   rohan          nth     12
2  melina    housewife     14
3  lokesh           US     16

newdf

In [13]:
newdf

     name        skill  marks
0   rajiv  webdevelopr     10
1   rohan          nth     12
2  melina    housewife     14
3  lokesh           US     16

In [15]:
newdf.drop(0,axis=0)

     name      skill  marks
1   rohan        nth     12
2  melina  housewife     14
3  lokesh         US     16

In [19]:
newdf
newdf.loc[[0,1],['name','skill']]

    name        skill
0  rajiv  webdevelopr
1  rohan          nth

In [20]:
newdf

     name        skill  marks
0   rajiv  webdevelopr     10
1   rohan          nth     12
2  melina    housewife     14
3  lokesh           US     16

In [ ]:
newdf.loc()